{
    "publications": [
        {
            "id": 1,
            "publication_date": "10.02.2025",
            "image": "https://habrastorage.org/getpro/habr/upload_files/5d0/a51/372/5d0a51372beee773c46a59fa559db496.png",
            "title": "Что такое MEV в блокчейне",
            "desc": "В большинстве блокчейнов транзакции, отправленные в mempool (пул неподтвержденных транзакций), упорядочиваются в блок перед добавлением в существующую цепочку блоков. Это делают валидаторы или майнеры.",
            "text": [
                "<h2>Как работает MEV?</h2>",
                "<p>Чтобы понять, как работает MEV, сначала нужно разобраться, как функционируют блокчейны. Для простоты рассмотрим пример блокчейна Ethereum.</p>",
                "<p>Когда пользователь отправляет транзакцию, она не выполняется мгновенно и не добавляется сразу в блокчейн. Сначала она поступает на узел Ethereum, который транслирует эту транзакцию другим узлам. Узлы проверяют её на валидность: проверяют подпись, наличие достаточных средств на кошельке пользователя и другие параметры. Если транзакция признана действительной, узел добавляет её в свой mempool — своего рода очередь неподтвержденных транзакций. Пока транзакция находится в этом состоянии между отправкой и подтверждением в блокчейне, она считается находящейся в «mempool» (от слов «memory» — память и «pool» — пул).</p>",
                "<p>Валидаторы выбирают транзакции из mempool для формирования следующего блока Ethereum. Обычно транзакции включаются в блок и упорядочиваются по убыванию цены газа. Цена газа — это сумма, которую пользователь готов заплатить за выполнение своей транзакции. Транзакции с низкой ценой газа могут надолго застрять в mempool или даже быть удалены. После того как транзакция включена в новый блок и добавлена в цепочку блоков, узлы видят её в блокчейне и удаляют из своих mempool.</p>",
                "<p>Этот процесс создания и упорядочивания блоков открывает возможности для MEV-искателей — опытных пользователей, которые используют автоматизированные боты для извлечения прибыли. Они могут изменять порядок транзакций или вставлять свои собственные перед целевыми, чтобы получать выгоду от движения цен или других факторов, связанных с выполнением этих операций.</p>",
                "<h2>Распространённые MEV-стратегии</h2>",
                "<h3>Фронтраннинг</h3>",
                "<p>Фронтраннинг — это стратегия, при которой MEV-искатель обнаруживает ордер на покупку или продажу другого трейдера в mempool и размещает идентичный ордер перед ним, извлекая прибыль из ценового эффекта, вызванного транзакцией жертвы.</p>",
                "<h3>Арбитраж</h3>",
                "<p>Арбитраж — это торговая стратегия, которая заключается в одновременной покупке и продаже одного и того же актива на двух разных рынках для получения прибыли за счёт разницы в ценах. На централизованных биржах и в традиционных финансах эта стратегия часто используется высокочастотными трейдерами. Однако в блокчейне арбитраж работает немного иначе из-за особенностей обработки транзакций.</p>"

            ],
            "authors": [
                {
                    "id": 1,
                    "fio_author": "Андрей Смирнов",
                    "desc_author": "Специалист по машинному обучению и нейросетям.",
                    "image_author": "https://t4.ftcdn.net/jpg/02/00/53/77/360_F_200537776_KzTIOQB6oXT9K2p8XoC3P3i9922gFMfP.jpg"
                }
            ],
            "categories": [
                {
                    "id": 1,
                    "name": "Основы программирования"
                },
                {
                    "id": 5,
                    "name": "Блокчейн"
                }
            ],
            "quotes": [
                {
                    "id": 1,
                    "text": "текст цитаты",
                    "name_publication": "название статьи, из которой взяли цитату",
                    "ref": "ссылка на статью",
                    "city_name": "Ульяновск"
                },
                {
                    "id": 2,
                    "text": "текст цитаты",
                    "name_publication": "название статьи, из которой взяли цитату",
                    "ref": "ссылка на статью",
                    "city_name": "Самара"
                }
            ]
        },
        {
            "id": 2,
            "publication_date": "23.02.2025",
            "image": "https://do.bincol.ru/pluginfile.php/6562/course/overviewfiles/6406eb7263b10024075083.jpg",
            "title": "Модуль информационной системы на основе ноивного байесовского классификатора для автоматизации работы аптеки",
            "desc": "Эффективным способом увеличения прибыли и укрепления рентабельности аптеки становится внедрение принципов автоматизации и управления деятельностью фармацевта с помощью информационных систем. Компании используют алгоритмы машинного обучения для корректировки своей стратегии, изучения отношения клиентов к своей организации посредством анализа отзывов и для повышения имиджа фирмы",
            "text": [
                "<p>Имидж является одним из важнейших средств достижения компанией своих целей. Зачастую при принятии покупателем решения о покупки товара или услуги репутация организации выходит на первый план. Парой даже негативные отзывы могут заставить клиента изменить свое решение. Потребители ощущают сомнения при совершении покупок при отсутствии какой-либо информации о компании. Поэтому растущее количество отзывов, желательно положительных, у фирмы является показателем ее успешной работы и числа довольных клиентов [1, 2]. Сегодня многие предприятия и организации используют в своей работе разнообразные информационные системы. Они могут быть связаны с различными областями деятельности предприятия, такими как автоматизация деятельности, бухгалтерия, управление персоналом и т. д. Под аптекой понимается специализированная организация системы здравоохранения, которая занимается производством, фасовкой и реализацией населению ассортимента лекарственных средств, биологически активных добавок и товаров медицинского назначения [3].</p> <p>В ежедневной деятельности аптеки большое количество времени тратится, как правило, на работу с поставщиками, заказ товара,продажу лекарственных средств, консультирование покупателей, работу с ценниками, накладными и т. д., кроме того, необходимо позаботиться и о способах привлечения клиентов в аптеку, что позволит увеличить поток покупателей и приведет к росту прибыли</p><p>Направление сентимент-анализа активно применяется на практике, а применение алгоритмов машинного обучения в коммерческих целях сегодня диктуется необходимостью классификации собранных статистических данных [4, 5]. Авторами работы [6] приводятся результаты численного эксперимента, в которых исследовались методы машинного обучения для классификации отзывов клиентов. В условиях современной экономики большинство предприятий делают ставку на долгосрочные отношения с клиентами и их позитивные эмоции в процессе потребления услуги. Для высокой конкурентоспособности предприятию необходимо эффективно управлять процессом оказания услуг, например с помощью анализа собираемой информации 64 Вестник кибернетики. 2024. Т. 23, № 2 Proceedings in Cybernetics. 2024. Vol. 23, No. 2 &copy; Святов К. В., Мошкин В. С., Щукарев И. А., 2024 от клиентов. Авторами проведено исследование отзывов клиентов с портала tophotels.ru. Показано, что машинное обучение позволяет классифицировать отзывы с точностью 85&ndash;88 %, а лемматизация повышает точность классификации отзывов на русском языке. В статье [7] анализируются отзывы клиентов относительно двух программных продуктов с целью сформулировать рекомендации по их улучшению для лиц, принимающих решение. Для решения поставленной задачи авторы использовали информацию, доступную на интернет-ресурсах. В качестве метода анализа был выбран наивный байесовский классификатор. Также авторами была разработана программа &laquo;OtClik&raquo;. Методика анализа тональности текстовой информации включала этапы лемматизации и разбиение текста на униграммы. Программная реализация выполнена на языке Python в виде десктопного приложения на компьютер. Авторами работы [8] рассматривается проблема анализа отзывов об отелях в сфере туризма. Туристы рассказывают о своих впечатлениях от пребывания в отеле, оставляя отзывы. При наличии большого количества отзывов туристы не могут понять, содержат ли они положительные или отрицательные мнения. Чтобы быстро определить, являются ли отзывы положительными или отрицательными, необходимо провести соответствующий анализ. Авторами предлагается решение путем классификации положительных и отрицательных отзывов с использованием метода наивного байесовского классификатора.</p><h2>МЕРИАЛЫ И МЕТОДЫ</h2><p>Для решения поставленной задачи предлагается использовать алгоритм наивного байесовского классификатора, программная реализация которого была выполнена как отдельная функция информационной системы организации. Для решения задачи классификации предварительно был создан корпус текстов с двумя категориями &ndash; положительные и отрицательные отзывы, а чтобы компьютер мог обрабатывать информацию, она была представлена в машиночитаемой форме [12].</p><h2>РЕЗУЛЬТАТЫ И ИХ ОБСУЖДЕНИЕ</h2><p>Для тестирования и оценки точности наивного байесовского классификатора были проведены серии экспериментов, результаты которых приведены в таблице. Точность вычислялась с помощью библиотеки nltk Python. Как видно из таблицы, наивысшая точность классификатора достигается при соотношении обучающей и тестовой выборки 80/20 без стоп-слов. Для проверки корректности работы классификатора дополнительно были найдены два отзыва, не входящих Рис. 1. Фрагмент кода классификатора на Python Примечание: написано авторами для исследования.Рис. 2. Фрагмент кода парсера на Python Примечание: написано авторами для исследования.67&copy; Святов К. В., Мошкин В. С., Щукарев И. А., 2024 в исходный корпус, которые классификатор верно отнес к соответствующим категориям.</p>"
            ],
            "authors": [
                {
                    "id": 3,
                    "fio_author": "Мошкин Вадим Сергеевич",
                    "desc_author": "Кандидат технических наук. Доцент, кафедра «Информационные системы», старший научный сотрудник, научно-исследовательский отдел Департамента научных исследований",
                    "image_author": "https://ulstu.ru/upload/iblock/512/Bez_nazvaniya_3_.png"
                }
            ],
            "categories": [
                {
                    "id": 5,
                    "name": "Автоматизация сложных бизнес-процессов"
                }
            ],
            "quotes": [
                {
                    "id": 1,
                    "text": "текст цитаты",
                    "name_publication": "название статьи, из которой взяли цитату",
                    "ref": "ссылка на статью",
                    "city_name": "Казань"
                }
            ]
        }
    ]
}